// Задача 19: Напишите программу, которая принимает на
// вход пятизначное число и проверяет, является ли оно
// палиндромом.
// 14212 -> нет
// 23432 -> да
// 12821 -> да

Console.Clear();
Console.Write("Введите пятизначный палиндром: ");
int palindrom = int.Parse(Console.ReadLine());

if([0] == [4])

if([1] == [3])
{
  Console.WriteLine($"Число {palindrom} является палиндромом");
}

else {
   Console.WriteLine($"Число {palindrom} НЕ является палиндромом");
}
